{
  "links": [
    { "name": "Github", "href": "https://github.com/bdebruyn02" },
    { "name": "Linkedin", "href": "https://www.linkedin.com/in/bdebruyn/" }
  ],
  "about_me": "Hi, I'm Brandon, a full-stack developer with a strong passion for coding. My primary tech stack includes ASP.NET and ASP.NET Web API, .NET Framework, C#, TypeScript, JavaScript, Angular, SCSS, CSS, Ionic, Firebase, and Microsoft SQL. I strive for excellence in all my projects and am dedicated to staying updated with the latest advancements in technology.",
  "experience": [
    {
      "title": "Intermediate Software Developer",
      "companyName": "CBOS",
      "employmentType": "Full-time",
      "location": "City of Cape Town, Western Cape, South Africa",
      "locationType": "Remote",
      "currentWorking": true,
      "startDate": "06/01/2024",
      "endDate": "",
      "description": "<p>At CBOS, I develop and maintain web applications using the .NET Framework, Angular, and ASP.NET MVC. My key contributions include:</p><p>• Building dynamic web applications with ASP.NET MVC and C#.<br>• Creating responsive front-end interfaces using Angular.<br>• Managing databases with Microsoft SQL Server and optimizing data access through Entity Framework.<br>• Collaborating in Agile teams to deliver high-quality software solutions.</p>"
    },
    {
      "title": "Software Developer",
      "companyName": "Microzone Solutions",
      "employmentType": "Full-time",
      "location": "Bloemfontein, Free State, South Africa",
      "locationType": "Remote",
      "currentWorking": false,
      "startDate": "03/01/2022",
      "endDate": "05/31/2024",
      "description": "<p>At Microzone, I maintained and developed software solutions by creating Micro-Front Ends in Angular and Micro API Services in ASP.NET C#. Key highlights include:</p><p>• Developed and optimized database changes using Microsoft SQL.<br>• Collaborated with senior developers on project management and strategic initiatives.<br>• Delivered projects in TypeScript, SQL, and C# as part of a small team, consistently exceeding deadlines through teamwork.</p>"
    },
    {
      "title": "Software Developer Internship",
      "companyName": "Microzone Solutions",
      "employmentType": "Full-time",
      "location": "Bloemfontein, Free State, South Africa",
      "locationType": "Remote",
      "currentWorking": false,
      "startDate": "02/01/2022",
      "endDate": "02/28/2022",
      "description": "<p>During my internship at Microzone, I enhanced my Full Stack Development skills, working with TypeScript, Angular, SCSS, and ASP.NET Web API. Key achievements include:</p><p>• Gained practical experience in SQL and full-stack technologies.<br>• Adapted to a dynamic work environment while staying updated on evolving industry standards.<br>• Worked under mentorship to implement code changes aligned with project design specifications.</p>"
    },
    {
      "title": "Lead Developer",
      "companyName": "OriginX RP",
      "employmentType": "Freelance",
      "location": "Bloemfontein, Free State, South Africa",
      "locationType": "Remote",
      "currentWorking": false,
      "startDate": "06/01/2020",
      "endDate": "04/31/2021",
      "description": "<p>In the Origin X Project, I contributed effectively both independently and as part of a team.&nbsp;<br>Key accomplishments include:</p><p>• Set up and configured a TeamSpeak server on Debian Linux via SSH.<br>• Configured a Rack Server to ensure global connectivity for end-users.<br>• Independently optimized the server to handle high workflow demands smoothly.</p>"
    }
  ],
  "projects": [
    {
      "name": "FiveM Launcher",
      "photoName": "TDLauncher.png",
      "shortDesc": "Built with Angular and Electron, the launcher lets you connect to any FiveM server without opening the FiveM program separately. I noticed people paying for a similar tool unnecessarily and created a free alternative. This project marked my first time combining Angular and Electron, with Electron enabling access to the native system shell for connecting to user-saved servers.",
      "href": "https://github.com/bdebruyn02/td-fivem-launcher",
      "feature": true
    },
    {
      "name": "Online Chatting App",
      "photoName": "vic_chat.jpg",
      "shortDesc": "Built with React and Firebase, this project let's you login through Google or Facebook, with Firebase handling real-time chatting and the authentication. I do not have much to say about the project; as it was more of a learning experience to explore React and Firebase.",
      "href": "https://github.com/bdebruyn02/react-chatapp",
      "feature": true
    },
    {
      "name": "Bundle of FiveM Scripts",
      "photoName": "fivem_lua_scripts.jpg",
      "shortDesc": "Written in Lua, this project contains various scripts to meet the needs of a FiveM server. The goal was to develop game modifications for these servers. There isn't much more to say about it, but it significantly helped my understanding of lua scripting, and improve on my coding skills.",
      "href": "https://github.com/bdebruyn02/FiveM-Scripts",
      "feature": true
    },
    {
      "name": "FiveM Server",
      "photoName": "originx.png",
      "shortDesc": "As the lead developer, I ran a successful FiveM Server in South Africa, drawing in a lively community of hundreds of players. The project taught me invaluable lessons in hosting and configuration servers. Along the way, I sharpened my skills in MySQL and Lua scripting, troubleshooting server performance issues, and debugging game code.",
      "href": "https://www.youtube.com/@originxrp5202",
      "feature": true
    },
    {
      "name": "E-Sports Scoring",
      "photoName": "scorecraft.png",
      "shortDesc": "Using Angular v17 and .NET 8 Web API with entity framework, I developed this project for managing e-sports teams, with additional functionality of match scheduling, score tracking and win rate ratio's for the team managers. The project goal was to learn standalone angular applications and how to integrate and use entity framework with .net web api. The project was fun, implementing entity framework into .net was something new to me, and i enjoyed learning it.",
      "href": "https://github.com/bdebruyn02/esports-scoring-app",
      "feature": true
    }
  ]
}
  